In [1]:
import pandas as pd
import sqlite3
from src.cleaning import DataCleaner

In [2]:
# import the csv files
raw_unemployment_data = pd.read_csv('data/raw/ssamatab1.csv', skiprows=2).dropna()
housing_value_data = pd.read_csv('data/raw/hpi_po_metro.csv')

In [3]:
# create data cleaner
unemployment_cleaner = DataCleaner(raw_unemployment_data)

In [4]:
# rename, drop null values, and type cast columns in the unemployment dataset

clean_unemployment_data = (
                            unemployment_cleaner
                           .rename_unemployment_columns()
                           .drop_n_values()
                           .unemployment_object_columns_to_int64()
                           )
clean_unemployment_df = clean_unemployment_data.df

In [ ]:
# make SQL database with tables "Unemployment" and "Housing_value"

with sqlite3.connect("database.db") as conn:
    clean_unemployment_df.to_sql("Unemployment", conn, if_exists='replace', index=False)
    housing_value_data.to_sql("Housing_value", conn, if_exists='replace', index=False)

In [9]:
query1 = """
SELECT "LAUS Code" FROM Unemployment
"""
result1 = pd.read_sql(query1, conn)
result1

              LAUS Code
0       MT0111500000000
1       MT0112220000000
2       MT0113820000000
3       MT0119300000000
4       MT0119460000000
...                 ...
168071  MT7211640000000
168072  MT7225020000000
168073  MT7232420000000
168074  MT7238660000000
168075  MT7241980000000

[168076 rows x 1 columns]